Desktop.org
#+TITLE: Desktop Environment Literal Configuration File
#+PROPERTY: header-args :mkdirp yes
#+PROPERTY: header-args:sh   :tangle-mode (identity #o555)
#+PROPERTY: header-args:conf :tangle-mode (identity #o555)

* TODO System Settings

Load system-specific settings from =.emacs.d/per-system-settings.el= and unpack relevant values into blocks so that they can be used in configuration file blocks. These settings are configured in [[file:Systems.org::*Per-System Settings][Systems.org]].

*DPI*

#+NAME: dpi
#+begin_src emacs-lisp
  (if (string= (system-name) "wheeler")
      (* 1024 180) ;; Wheeler/laptop
      (* 1024 96)) ;; Hopper/desktop
#+end_src

* Fonts and Themes

I use [[https://github.com/derat/xsettingsd][xsettingsd]] as a minimal settings daemon for Xorg applications. It replaces similar daemons from desktop environments like GNOME and XFCE and enables me to use a simple configuration file like the following:

*.config/xsettingsd/xsettingsd.conf:*

#+begin_src conf :tangle .config/xsettingsd/xsettingsd.conf :noweb yes

Net/ThemeName "Matcha-dark-azul"
Net/IconThemeName "Papirus-Dark"
Gtk/DecorationLayout "menu:minimize,maximize,close"
Gtk/FontName "Cantarell 6"
Gtk/MonospaceFontName "Fira Mono 5"
Gtk/CursorThemeName "Adwaita"
Xft/Antialias 1
Xft/Hinting 0
Xft/HintStyle "hintnone"
Xft/DPI <<dpi()>> # 1024 * DPI

#+end_src

*Arch Packages*

Make sure to install:

- xsettingsd
- ttf-fira-code
- cantarell-fonts
- ttf-jetbrains-mono
- ttc-iosevka-aile
- ttf-font-awesome (not necessary)
- *AUR* ttf-material-design-icons

* Window Management

For window management I use the fantastic Emacs Window Manager [[https://github.com/ch11ng/exwm][EXWM]]. For more information, the [[https://github.com/ch11ng/exwm/wiki][Wiki]] is a good place to start. The configuration is written to a seperate package in my emacs.d lisp directory. Make sure =exwm= gets loaded early. All the Desktop configuration goes into a seperate file: =~/.emacs.d/lisp/mb-desktop.el=. I'll add this file to the load path at the end. Note, I copied the code from =David Wilson=, but simplified it based upon the great [[https://github.com/daviwil/emacs-from-scratch/][Emacs From Scratch]] series.

** Helper functions

First, we define a set of helper functions. These can be used to easily create keybindings, customize window placement and more.

#+begin_src emacs-lisp :tangle .emacs.d/lisp/mb-desktop.el

  (defun efs/run-in-background (command)
    (let ((command-parts (split-string command "[ ]+")))
      (apply #'call-process `(,(car command-parts) nil 0 nil ,@(cdr command-parts)))))

  ;; This function takes the name of the wallpaper, defined in Systems.org, and sets the
  ;; correct wallpaper. You could also just write a fixed path here.
  (defun efs/set-wallpaper ()
    (interactive)
    (start-process-shell-command
     "feh" nil
     (format "feh --bg-scale ~/.dotfiles/backgrounds/samuel-ferrara-uOi3lg8fGl4-unsplash.jpg")))

  (defun efs/bind-function (key invocation &rest bindings)
    "Bind KEYs to FUNCTIONs globally"
    (while key
      (exwm-input-set-key (kbd key)
                          `(lambda ()
                             (interactive)
                             (funcall ',invocation)))
      (setq key (pop bindings)
            invocation (pop bindings))))

  (defun efs/bind-command (key command &rest bindings)
    "Bind KEYs to COMMANDs globally"
    (while key
      (exwm-input-set-key (kbd key)
                          `(lambda ()
                             (interactive)
                             (efs/run-in-background ,command)))
      (setq key (pop bindings)
            command (pop bindings))))

  (defun efs/exwm-init-hook ()
    ;; Make workspace 1 be the one where we land at startup
    (exwm-workspace-switch-create 1)

    ;; Open eshell by default
    (eshell)

    ;; NOTE: The next two are disabled because we now use Polybar!

    ;; Show battery status in the mode line
    ;;(display-battery-mode 1)

    ;; Show the time and date in modeline
    ;;(setq display-time-day-and-date t)
    ;;(display-time-mode 1)
    ;; Also take a look at display-time-format and format-time-string

    ;; Start the Polybar panel
    (efs/start-panel)

    ;; Launch apps that will run in the background
    (efs/run-in-background "dunst")
    (when (string= (system-name) "wheeler")
      (efs/run-in-background "nm-applet"))
    (efs/run-in-background "udiskie -t"))
  ;; (efs/run-in-background "syncthing-gtk --minimized"))

  (defun efs/exwm-update-class ()
    (exwm-workspace-rename-buffer exwm-class-name))

  (defun efs/exwm-update-title ()
    (pcase exwm-class-name
      ("Qutebrowser" (exwm-workspace-rename-buffer (format "QB: %s" exwm-title)))))

  ;; This function isn't currently used, only serves as an example how to
  ;; position a window
  (defun efs/position-window ()
    (let* ((pos (frame-position))
           (pos-x (car pos))
           (pos-y (cdr pos)))

      (exwm-floating-move (- pos-x) (- pos-y))))

  (defun efs/configure-window-by-class ()
    (interactive)
    (pcase exwm-class-name
      ("Qutebrowser" (exwm-workspace-move-window 2))
      ("Spotify"     (exwm-workspace-move-window 4))
      ("mpv"         (exwm-floating-toggle-floating)
       (exwm-layout-toggle-mode-line))))

#+end_src

