Desktop.org
*** Configuration

#+begin_src python :tangle .config/qutebrowser/config.py :mkdirp yes :noweb yes

  # Open every tab as a new window, Vimb style
  # c.tabs.tabs_are_windows = True
  # c.tabs.show = "multiple"
  c.tabs.last_close = "close"

  c.auto_save.session = True
  c.scrolling.smooth = True
  c.session.lazy_restore = True
  c.content.autoplay = False

  # Scale pages and UI better for hidpi
  c.zoom.default = "100%"
  c.fonts.hints = "bold 20pt monospace"

  # Better default fonts
  c.fonts.web.family.standard = "Bitstream Vera Sans"
  c.fonts.web.family.serif = "Bitstream Vera Serif"
  c.fonts.web.family.sans_serif = "Bitstream Vera Sans"
  c.fonts.web.family.fixed = "Fira Mono"
  c.fonts.statusbar = "12pt Cantarell"

  # Use dark mode where possible
  #c.colors.webpage.darkmode.enabled = True
  #c.colors.webpage.darkmode.policy.images = "never"
  #c.colors.webpage.bg = "black"

  # Automatically turn on insert mode when a loaded page focuses a text field
  # c.input.insert_mode.auto_load = True

  # Edit fields in Emacs with Ctrl+E
  c.editor.command = ["emacsclient", "+{line}:{column}", "{file}"]

  # Make Ctrl+g quit everything like in Emacs
  config.bind('<Ctrl-g>', 'leave-mode', mode='insert')
  config.bind('<Ctrl-g>', 'leave-mode', mode='command')
  config.bind('<Ctrl-g>', 'leave-mode', mode='prompt')
  config.bind('<Ctrl-g>', 'leave-mode', mode='hint')

  # Tweak some keybindings
  # config.unbind('d') # Don't close window on lower-case 'd'
  config.bind('yy', 'yank')

  # Vim-style movement keys in command mode
  config.bind('<Ctrl-j>', 'completion-item-focus --history next', mode='command')
  config.bind('<Ctrl-k>', 'completion-item-focus --history prev', mode='command')

  # More binding hints here: https://gitlab.com/Kaligule/qutebrowser-emacs-config/blob/master/config.py
  # Search Machines
  c.url.searchengines = {'DEFAULT': 'https://duckduckgo.com/?q={}',
                         'g': 'https://google.com/search?q={}',
                         'r': 'https://reddit.com/r/{}',
                         "osm": "https://www.openstreetmap.org/search?query={}",
                         }

  # Load the autoconfig file (quteconfig.py)
  config.load_autoconfig()

#+end_src

*** Quickmarks

Here I define my =quickmarks=, I should really update them!

#+begin_src conf :tangle .config/qutebrowser/quickmarks :mkdirp yes
  gg  https://www.google.com
  nos https://www.nos.nl
  fm  https://www.nederland.fm
  sp  https://open.spotify.com/
  na  http://192.168.178.53:5000
  hp  https://www.hpdetijd.nl/
  sc  https://systemcrafters.cc/
  gtd https://github.com/rougier/emacs-gtd
  fed https://github.com/davidstrauss/desktop-configuration
#+end_src

** Flatpak

I use Flatpak and the [[https://flathub.org/home][Flathub]] repository to install applications that are otherwise difficult to install in Guix because of application frameworks, etc.

*Applications to Install*

#+begin_src sh

  flatpak remote-add --user --if-not-exists flathub https://flathub.org/repo/flathub.flatpakrepo
  flatpak remote-add --user --if-not-exists flathub-beta https://flathub.org/beta-repo/flathub-beta.flatpakrepo

  # Install Spotify
  flatpak install --user flathub com.spotify.Client

  # Install Firefox
  flatpak install flathub org.mozilla.firefox

#+end_src

*Arch Packages*

flatpak

* Notes

** Bluetooth Setup

Stolen from David Wilson's config, I defined two functions to automatically connect to either my home speaker or Galaxy Buds+.

#+begin_src emacs-lisp :tangle .emacs.d/lisp/mb-desktop.el

  (defun mb/bluetooth-connect-Edifier ()
    (interactive)
    (start-process-shell-command "bluetoothctl" nil "bluetoothctl -- connect 40:EF:4C:94:F6:B9"))

  (defun mb/bluetooth-connect-Buds ()
    (interactive)
    (start-process-shell-command "bluetoothctl" nil "bluetoothctl -- connect 18:54:CF:10:DB:85"))

  (defun mb/bluetooth-disconnect ()
    (interactive)
    (start-process-shell-command "bluetoothctl" nil "bluetoothctl -- disconnect"))

#+end_src

If you need to manually connect to Bluetooth audio devices using =bluetoothctl=,
as I currently do in Guix, you'll need to enter these commands at the
=bluetoothctl= prompt:

#+begin_src shell

  system-alias "my-hostname" # To configure your laptop's device name
  default-agent
  power on
  scan on
  # Wait for your device to appear
  pair 40:EF:4C:94:F6:B9
  trust 04:52:C7:5E:5C:A8 # To enable auto-connect
  connect 40:EF:4C:94:F6:B9

#+end_src
* Provide the mb-desktop package

#+begin_src emacs-lisp :tangle .emacs.d/lisp/mb-desktop.el

  (provide 'mb-desktop)

#+end_src
