.emacs.d/lisp/mb-desktop.el

(defun mb/bluetooth-connect-Edifier ()
  (interactive)
  (start-process-shell-command "bluetoothctl" nil "bluetoothctl -- connect 40:EF:4C:94:F6:B9"))

(defun mb/bluetooth-connect-Buds ()
  (interactive)
  (start-process-shell-command "bluetoothctl" nil "bluetoothctl -- connect 18:54:CF:10:DB:85"))

(defun mb/bluetooth-disconnect ()
  (interactive)
  (start-process-shell-command "bluetoothctl" nil "bluetoothctl -- disconnect"))

(provide 'mb-desktop)
